;(function () {
	'use strict';

	const articles = [
		{
			id: 1,
			title: 'Сибирский хаски',
			content: `# Сибирский хаски
![](http://mayaksbor.ru/upload/iblock/e80/e803763c8baa8c2fc3f634d0a35282db.jpg)
### Характер
Дружелюбный и спокойный, но вместе с этим живой.
Собака категорически непригодна для использования в качестве охотничьей, сторожевой и охранной. Собака излишне самостоятельна, поэтому плохо годится на роль служебной.

Сибирский хаски легко обживается на новом месте и неплохо подходит для квартирного содержания. Имеет отличные умственные способности, которые почти не требуют дополнительного развития, однако рекомендуются частые игры и занятия. 

Сибирские хаски имеют склонность к убеганию.
### Уход
Собака очень чистоплотная, не слюнявая, шерстный покров и кожа не имеют запаха. Линька проходит два раза в год естественным образом, без подстригания. Особого ухода животное не требует, во время линьки подшерсток (довольно густой) вычесывается, чем облегчается течение процесса.

Собаки этой породы нуждаются в постоянных физических нагрузках.

На выставках на ринге используется ринговка.`
		},
		{
			id: 2,
			title: 'Бигль',
			content: `# Бигль
![](http://ufatime.ru/media/f/f6/d8/f6d87ca9-1acb-4e2b-bc02-ab9096b3b405/sobaka_dog_bigl.jpg)

### Общее описание
Среднего размера, внешне сходна с фоксхаундом, но мельче, с более короткими ногами и более длинными и мягкими ушами (уши должны доходить до кончика носа). 

Рост от 13 до 16 дюймов (33 и 40 см) в холке, вес между 18 и 35 фунтами, суки мельче кобелей. 

Челюсти сильные. Глаза большие, коричневые либо светло-коричневые. Губы умеренно отвислые. Мочка носа широкая. Шея средней длины. Грудная клетка широкая, сужающаяся к клиновидному животу и талии. Хвост толстый, средней длины, поставлен высоко и держится весело. Хвост хорошо опушён, особенно к концу, где волосы образуют кисточку. У бигля мускулистое, гладкое тело, средней длины. Бёдра мощные. Лапы круглые или слегка вытянутые. Пальцы крепкие, плотно собранные. Подушечки компактные.
### Характер
Бигль — это добрая, ласковая и весёлая собака. Прирождённый исследователь неведомого, он так и норовит отвязаться и убежать, поэтому за ним необходим особый контроль; лучше всего не спускать его с поводка во время прогулки. Бигль неплохо ладит с незнакомыми людьми и другими животными, Бигль — энергичная собака, предпочитающая находиться среди большого числа людей.

Бигль — умный и преданный компаньон. Он очень чистоплотен и не нуждается вследствие этого в частых купаниях. Добавим, что если эти собаки хорошо выучены, они великолепно общаются со всеми членами семьи, особенно с детьми. Некоторые особи данной породы иногда (но очень редко!) могут проявить агрессивность по отношению к незнакомым людям или собакам.`
		},
		{
			id: 3,
			title: 'Далматин',
			content: `# Далматин
![](https://www.ridus.ru/images/2019/2/14/881269/in_article_0abde2f942.jpg)

### Общее описание
Далматин — достаточно крупная, сильная и выносливая собака, способная преодолевать большие расстояния. Пропорции тела весьма гармоничны. Отношение длины корпуса к высоте в холке составляет 10:9, длина черепа и длина морды 1:1. Темперамент далматина очень уравновешенный.

У этой породы собак имеется одна особенность, которая должна быть определяющей в породе. Нос у чёрно-пятнистых собак должен быть всегда чёрный, у коричнево-пятнистых — всегда коричневый. Губы не должны быть отвисшими, желательна полная их пигментация, хотя допускается и частичная. Челюсти сильные, с безупречным ножницеобразным прикусом. Желателен полный комплект из 42 зубов в соответствии с зубной формулой. Любое отклонение от правильного прикуса считается пороком, не позволяющим использовать собаку в племенном разведении.

Глаза имеют тёмно-коричневый цвет, у чёрно-пятнистых собак светло-коричневый, иногда встречаются голубоглазые. У коричнево-пятнистых допускаются желтовато-коричневые оттенки. Обводка века должна быть сплошной, без разрывов и пятен. Веко должно прилегать к глазному яблоку.

Уши у собак этой породы посажены довольно высоко, среднего размера, широкие у основания, желательно пятнистые, но могут иметь мраморный рисунок, прилегают к щекам.

Хвост примерно достигает скакательного сустава, в спокойном состоянии держится вниз, в движении поднимается, но не должен закручиваться и держаться вертикально. На хвосте желательно наличие пятен.

Движения свободные, активные, с широким и длинным шагом. Если смотреть на собаку этой породы сзади, конечности должны двигаться совершенно параллельно, задние должны ступать в след передних. Короткий, семенящий шаг считается неправильным.

Шерсть густая, короткая и жёсткая, основной окрас белый, пятна по белому фону должны быть чёткими, круглыми (размерами с двухрублёвую монету), как можно более равномерно распределены, но могут сливаться друг с другом. Как и любая гладкошерстная собака, линяет круглый год. При этом окрас может меняться. Далматин чистоплотен, не имеет запаха «псины».`
		},
		{
			id: 4,
			title: 'Корги',
			content: `# Корги
![](https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Pembroke_Welsh_Corgi_in_Grass.jpg/220px-Pembroke_Welsh_Corgi_in_Grass.jpg)

### Общее описание
Вельш-корги — это небольшая собака ростом около тридцати сантиметров и массой тела до четырнадцати килограммов. Существуют два основных вида вельш-корги — пемброк и кардиган, которые довольно серьёзно различаются между собой. Так, например, пемброк немного меньше, также у этих видов разная форма головы и строение грудных конечностей.

### Характер
Вельш-корги отличает огромное жизнелюбие, живость, доброжелательность. Корги — преданные, трепетно любят семью своего хозяина. Они лояльно относятся ко всем людям и другим животным, легко уживаются с кошками. Очень тепло относятся к детям, особенно маленьким, следят за ними и оберегают. Спокойно переносят жизнь в городе. К климату приспосабливаются без особого труда, но из-за очень густого подшёрстка лучше чувствуют себя в холодную погоду, чем в жару.

Это очень весёлая и подвижная собака. Корги очень любят играть и требуют продолжения, если хозяин решил закончить игру. Со всеми домочадцами они поддерживают прекрасные отношения, не показывая явно своего предпочтения. При этом с теми, кто не желает их принять, «держат дистанцию». Они точно знают, когда можно подойти и приласкаться, когда лучше не попадаться на глаза, когда можно покапризничать, а когда от них требуется полная отдача.

Вельш-корги пемброк и кардиган похожи по характеру, но есть и различия. Например, и кардиган, и пемброк дружелюбные добродушные собаки, привязанные к своему хозяину, уравновешенные, очень обаятельные, превосходные компаньоны, также обладающие чувством такта и даже чувством юмора (что отмечено в стандарте породы). Но, в отличие от пемброка, кардиган спокойнее, рассудительнее и осторожнее, а пемброк более возбудимый, живой и чуткий.

По обучаемости эта порода может уступить разве что бордер-колли. Запоминание команды со второго-третьего раза — не редкость, а норма. Легко и с интересом пемброки обучаются цирковым номерам, участвуют в аджилити, флайболе и других соревнованиях. Впрочем, изучение привычек хозяев и использование полученных знаний в своих собачьих интересах тоже не редкость. При этом шкодливость и злопамятность, как правило, отсутствуют у этой породы в принципе.

Вельш-корги склонны к перееданию, поэтому для слабовольного хозяина эта порода противопоказана. Нужно иметь в себе силы противостоять обаянию и хитроумию очаровательнейших попрошаек. Иначе собака запросто может превратиться в малоподвижное перекормленное существо.`
		},
		{
			id: 5,
			title: 'Такса',
			content: `# Такса
![](https://lapkins.ru/upload/iblock/927/927533be82751b45923e8348d5430468.jpg)

### Общее описание
Крепкая, с массивным костяком собака, прочно стоящая на земле, с длинной вытянутой мордой, ушки длинные, мягкие, закругляются на концах. Спина мускулистая, крепкая, грудь объёмная, глубокая, с характерным «килем» впереди. Хвост, толстый и крепкий у основания, поставлен низко, обычно держится чуть ниже линии спины, при возбуждении торчит вверх, как антенна. Конечности короткие, толстые, с рельефной мускулатурой (особенно передние). Передние лапы шире и больше задних. Передвигается свободно, размашисто.

### Характер
Такса дружелюбная, смелая, не агрессивная собака с уравновешенным темпераментом. Страстная, выносливая, проворная охотничья собака с хорошим чутьем. (В соответствии со стандартом FCI)

Такса работает по барсуку, лисице, еноту, кровяному следу, если надо, подаст утку из водоёма, предупредит о кабане и медведе. Это собака с громким голосом, отважная, с охранными качествами, смелая, серьёзная, целеустремлённая и самостоятельная.

Собака обладает сильным характером, ярко выраженной индивидуальностью, предана своей семье, хорошо ладит с детьми.`
		}
	];

	if (!localStorage.getItem('articles')) {
		localStorage.setItem('articles', JSON.stringify(articles));
	}

})();